In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import glob as gb

In [9]:
pwd

'C:\\Users\\choir\\Documents\\GitHub\\TDSN_SOBI\\Code'

In [12]:
data1 = pd.read_csv("C:/Users/Choir/Documents/GitHub/TDSN_SOBI/Datasource/Public Service/DKI Jakarta/Pariwisata/data-jumlah-kunjungan-wisatawan-mancanegara-ke-destinasi-wisata-di-provinsi-dki-jakarta-bulan-agustus-tahun-2020.csv")

In [13]:
data1.describe()

        tahun  bulan      jumlah
count    20.0   20.0   20.000000
mean   2020.0    8.0   18.900000
std       0.0    0.0   52.851231
min    2020.0    8.0    0.000000
25%    2020.0    8.0    0.000000
50%    2020.0    8.0    0.000000
75%    2020.0    8.0    2.000000
max    2020.0    8.0  209.000000

In [5]:
data1.head(3)

   tahun  bulan            destinasi_wisata  jumlah
0   2020      8     Taman Impian Jaya Ancol       0
1   2020      8  Taman Mini Indonesia Indah       0
2   2020      8    Taman Margasatwa Ragunan       0

In [14]:
data_2 = pd.read_csv('C:/Users/Choir/Documents/GitHub/TDSN_SOBI/Datasource/Public Service/DKI Jakarta/Pariwisata/data-jumlah-statistik-wisata-di-provinsi-dki-jakarta-tahun-2017.csv')

In [15]:
data_2.head(5)

   tahun                                          indikator    jumlah
0   2017                      Jumlah Wisatawan Mancanegara    2658055
1   2017                        Jumlah Wisatawan Nusantara   35464110
2   2017      Tingkat Penghunian Kamar Hotel Berbintang (%)        26
3   2017     Tingkat Penghunian Kamar Hotel Non Bintang (%)         5
4   2017  Rata-rata lama menginap wisatawan mancanegara ...        61

In [16]:
data_3 = pd.read_csv('C:/Users/Choir/Documents/GitHub/TDSN_SOBI/Datasource/Public Service/DKI Jakarta/Pariwisata/data-kategori-event-di-dki-jakarta-tahun-2016.csv')
data_3.head(5)

   tahun jenis_event  jumlah
0   2016      Musik       59
1   2016    Pameran      108
2   2016    Festival      55
3   2016      Budaya      37
4   2016     Edukasi       5

In [19]:
data_4 = pd.read_csv('C:/Users/Choir/Documents/GitHub/TDSN_SOBI/Datasource/Public Service/DKI Jakarta/Pariwisata/data-rata-rata-lama-menginap-wisatawan-nusantara-di-hotel-berbintang-provinsi-dki-jakarta-tahun-2016.csv')
data_4.head(5)

   tahun  bulan jenis_hotel  jumlah keterangan
0   2016      1   Bintang 5    71.1          %
1   2016      2   Bintang 5    48.2          %
2   2016      3   Bintang 5    82.1          %
3   2016      4   Bintang 5    27.1          %
4   2016      5   Bintang 5    86.2          %

In [20]:
data_5 = pd.read_csv('C:/Users/Choir/Documents/GitHub/TDSN_SOBI/Datasource/Public Service/DKI Jakarta/Pariwisata/\
data-jumlah-hotel-berbintang-dan-non-bintang-jakarta-tahun-2020.csv')

In [23]:
data_5.describe()

       jumlah_kamar
count    426.000000
mean     129.173709
std      117.097256
min       11.000000
25%       50.000000
50%       90.000000
75%      165.000000
max      889.000000

In [26]:
data_6 = pd.read_csv('C:/Users/Choir/Documents/GitHub/TDSN_SOBI/Datasource/Public Service/DKI Jakarta/Pariwisata/\
data-jumlah-peserta-pelatihan-profesi-kepariwisataan-di-provinsi-dki-jakarta-tahun-2019.csv')

In [28]:
data_6.head(3)

   tahun        nama_profesi  jumlah_peserta           keterangan
0   2019  Profesi Life Guard               0            Pendaftar
1   2019  Profesi Life Guard               0        Peserta Lulus
2   2019  Profesi Life Guard               0  Peserta Tidak Lulus

In [29]:
data_7 = pd.read_csv('C:/Users/Choir/Documents/GitHub/TDSN_SOBI/Datasource/Public Service/DKI Jakarta/Pariwisata/\
data-jumlah-usaha-jasa-pariwisata-tahun-2018.csv')

In [33]:
data_7.describe()

        tahun       jumlah  Unnamed: 4  Unnamed: 5
count    11.0    11.000000         0.0         0.0
mean   2018.0   386.909091         NaN         NaN
std       0.0   812.137606         NaN         NaN
min    2018.0     3.000000         NaN         NaN
25%    2018.0    24.000000         NaN         NaN
50%    2018.0    43.000000         NaN         NaN
75%    2018.0   267.000000         NaN         NaN
max    2018.0  2763.000000         NaN         NaN

In [34]:
data_8 = pd.read_csv('C:/Users/Choir/Documents/GitHub/TDSN_SOBI/Datasource/Public Service/DKI Jakarta/Pariwisata/\
data-jumlah-usaha-pariwisata-bidang-hiburan-dan-rekreasi-menurut-jenis-usaha-dan-kecamatan.csv')

In [35]:
data_8.head(2)

  jenis_usaha    kecamatan        wilayah
0  Bola Sodok  Kebon Jeruk  Jakarta Barat
1  Bola Sodok      Tambora  Jakarta Barat

In [48]:
data_9 = pd.read_csv('C:/Users/Choir/Documents/GitHub/TDSN_SOBI/Datasource/Public Service/DKI Jakarta/Pariwisata/\
data-kunjungan-wisata-mancanegara-ke-indonesia-menurut-pintu-masuk-tahun-1995-2000.csv')

In [49]:
data_9.head(3)

   tahun                   pintu_masuk   jumlah
0   1995  Bandar Udara Soekarno-Hatta   1259264
1   1996  Bandar Udara Soekarno-Hatta   1565706
2   1997  Bandar Udara Soekarno-Hatta   1486646

In [52]:
print(data_9['pintu_masuk'].unique())

['Bandar Udara Soekarno-Hatta ' 'Bandar Udara Ngurah Rai '
 'Bandar Udara Polonia ' 'Batam ' 'Lainnya ']

In [45]:
data_10 = pd.read_csv('C:/Users/Choir/Documents/GitHub/TDSN_SOBI/Datasource/Public Service/DKI Jakarta/Pariwisata/\
data-kunjungan-wisatawan-mancanegara-ke-provinsi-dki-jakarta-bulan-januari-tahun-2020-melalui-2-pintu-masuk.csv'
)

In [46]:
data_10.head(4)

   tahun  bulan kedatangan_wisata_mancanegara  jumlah
0   2020      1        Bandara Soekarno-Hatta  173453
1   2020      1              Bandara Halim PK     161

In [56]:
print(data_10['kedatangan_wisata_mancanegara'].unique())
print(data_10['bulan'].unique())
print(data_10['tahun'].unique())

['Bandara Soekarno-Hatta' 'Bandara Halim PK']
[1]
[2020]